ch: 6
nc: 5 
scales: 
  s: [0.67, 0.50, 1024]
  
backbone:
  - [-1, 1, INPUT, []]  # 0 
  - [-1, 1, DUALIN, [1]]  # 1 ：rgb = INPUT[:3]
  - [-2, 1, DUALIN, [2]]  # 2 ：ir = INPUT[3:]

  - [1, 1, Conv, [64, 3, 2]]  # 3
  - [2, 1, Conv, [ 64, 3, 2 ] ]  # 4

  - [3, 1, Conv, [128, 3, 2]]  # 5
  - [4, 1, Conv, [128, 3, 2]]  # 6
  - [5, 3, C2f, [128, True]]  # 7
  - [6, 3, C2f, [128, True ] ] # 8

  - [7, 1, Conv, [256, 3, 2]]  # 9
  - [8, 1, Conv, [256, 3, 2]]  # 10
  - [9, 6, C2f, [256, True]]      # 11
  - [10, 6, C2f, [256, True]]      # 12

  - [11, 1, Conv, [512, 3, 2]]     # 13
  - [12, 1, Conv, [512, 3, 2]]     # 14
  - [13, 6, C2f, [512, True]]      # 15
  - [14, 6, C2f, [512, True]]      # 16

  - [15, 1, Conv, [1024, 3, 2]]     # 17
  - [16, 1, Conv, [1024, 3, 2]]     # 18
  - [17, 3, C2f, [1024, True]]      # 19
  - [18, 3, C2f, [1024, True]]      # 20
  - [19, 1, SPPF, [1024, 5]]     # 21
  - [20, 1, SPPF, [1024, 5]]     # 22

  - [[11, 12], 1, Concat, [1]]  # 23
  - [[15, 16], 1, Concat, [1]]  # 24
  - [[21, 22], 1, FSAM, [0]]  # 25


head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 26
  - [[-1, 24], 1, Concat, [1]]  # 27
  - [-1, 3, C2f, [512]]  # 28
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 29
  - [[-1, 23], 1, Concat, [1]]  # 30
  
  - [-1, 3, C2f, [256]]  # 31
  - [-1, 1, Conv, [256, 3, 2]] # 32
  - [[-1, 28], 1, Concat, [1]]  # 33
  - [-1, 3, C2f, [512]]  # 34
  - [-1, 1, Conv, [512, 3, 2]] # 35
  - [[-1, 25], 1, Concat, [1]]  # 36
  - [-1, 3, C2f, [1024]]  # 37

  - [[31, 34, 37], 1, OBB, [nc, 1]] 
